package com.programmergabut.solatkuy.util.generator

import com.programmergabut.solatkuy.data.local.localentity.Dua

class DuaGenerator {

    companion object{

        fun getListDua(): MutableList<Dua> {

            val listDua = mutableListOf<Dua>()

            listDua.add(Dua(1,"Dua After Adhan",
                "اَللهُمَّ رَبَّ هذِهِ الدَّعْوَةِ التَّآمَّةِ، وَالصَّلاَةِ الْقَآئِمَةِ، آتِ مُحَمَّدَانِ الْوَسِيْلَةَ وَالْفَضِيْلَةَ وَالشَّرَفَ وَالدَّرَجَةَ الْعَالِيَةَ الرَّفِيْعَةَ وَابْعَثْهُ مَقَامًامَحْمُوْدَانِ الَّذِىْ وَعَدْتَهُ اِنَّكَ لاَتُخْلِفُ الْمِيْعَادَ يَآاَرْحَمَ الرَّحِمِيْنَ",
                "Allaahumma robba haadzihid da'watit taammah, washsholaatil qoo-imah, aati muhammadanil washiilata wal fadhiilah, wasysyarofa, wad darajatal, 'aaliyatar rofii'ah, wab'atshu maqoomam mahmuudanil ladzii wa'adtah, innaka laa tukhliful mii'aadz",
                "O Allah! Lord of this perfect call (perfect by not ascribing partners to You) and of the regular prayer which is going to be established, give Muhammad the right of intercession and illustriousness, and resurrect him to the best and the highest place in Paradise that You promised him (of)], then my intercession for him will be allowed on the Day of Resurrection.",
                "Ya Allah Tuhan yang memiliki seruan yang sempurna dan shalat yang tetap didirikan, kurniailah Nabi Muhammad wasilah (tempat yang luhur) dan kelebihan serta kemuliaan dan derajat yang tinggi dan tempatkanlah dia pada kependudukan yang terpuji yang telah Engkaujanjikan, sesungguhnya Engkau tiada menyalahi janji, wahai dzat yang paling Penyayang.",
            "-"))

            listDua.add(Dua(2, "Dua Save from Hell & World",
                "اَللهُمَّ اِنَّا نَسْئَلُكَ سَلاَمَةً فِى الدِّيْنِ وَعَافِيَةً فِى الْجَسَدِ وَزِيَادَةً فِى الْعِلْمِ وَبَرَكَةً فِى الرِّزْقِ وَتَوْبَةً قَبْلَ الْمَوْتِ وَرَحْمَةً عِنْدَ الْمَوْتِ وَمَغْفِرَةً بَعْدَ الْمَوْتِ. اَللهُمَّ هَوِّنْ عَلَيْنَا فِىْ سَكَرَاتِ الْمَوْتِ وَالنَّجَاةَ مِنَ النَّارِ وَالْعَفْوَ عِنْدَ الْحِسَابِ",
                "Allaahumma innaa nas aluka salaamatan fid diin, wa 'aafiyatan fil jasad, wa ziyadatan fil 'ilmi, wabarokatan dir rizqi, wa taubatan qoblal maut, warohmatan indal maut, wa maghfirotan ba'dal maut. Allaahumma hawwin 'alainaa fii sakarootil maut, wan najaata minan naar, wal 'afwa indal hisaab",
                "-",
                "Ya Allah, sesungguhnya kami memohon kepada-Mu keselamatan ketika beragama, kesehatan badan, limpahan ilmu, keberkahan rezeki, taubat sebelum datangnya maut, rahmat pada saat datangnya maut, dan ampunan setelah datangnya maut. Ya Allah, mudahkanlah kami dalam menghadapi sakaratul maut, berikanlah kami keselamatan dari api neraka, dan ampunan pada saat hisab.",
                "-"))

            listDua.add(Dua(3, "Ayatul Kursi",
                "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                "Alloohu laa ilaaha illaa huwal hayyul qoyyuum, laa ta’khudzuhuu sinatuw walaa naum. Lahuu maa fissamaawaati wa maa fil ardli man dzal ladzii yasyfa’u ‘indahuu illaa biidznih, ya’lamu maa baina aidiihim wamaa kholfahum wa laa yuhiithuuna bisyai’im min ‘ilmihii illaa bimaa syaa’ wasi’a kursiyyuhus samaawaati wal ardlo walaa ya’uuduhuu hifdhuhumaa wahuwal ‘aliyyul ‘adhiim.",
                "Allah! There is no god but He - the Living, the Self-subsisting, Eternal. No slumber can seize Him nor Sleep. His are all things in the heavens and on earth. Who is there can intercede in His presence except as he permitteth? He knoweth what (appeareth to His creatures As) Before or After or Behind them. Nor shall they compass aught of His knowledge except as He willeth. His throne doth extend over the heavens and on earth, and He feeleth no fatigue in guarding and preserving them, For He is the Most High, the Supreme (in glory).",
                "Allah, tidak ada Tuhan (yang berhak atau boleh disembah), melainkan Dia yang hidup kekal lagi terus menerus mengurus (makhluk-Nya). Yang tidak mengantuk dan tidak juga tertidur. Kepunyaan-Nya adalah apa yang ada di langit dan apa yang ada di bumi. Tiada yang dapat memberi syafaat di sisi Allah tanpa izin-Nya.\n" +
                        "Sesungguhnya Allah maha mengetahui apa yang ada di hadapan mereka dan di belakang mereka. Dan mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya.\n" +
                        "Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya, dan Allah Maha tinggi lagi maha besar.",
                "https://www.quran411.com/ayatul-kursi \nhttps://qazwa.id/blog/ayat-kursi/"))

            /* listDua.add(Dua(4,"Yasin","بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيمِ\n \n" +
                    "يسٓ :١\n \n" +
                    "وَالْقُرْءَانِ الْحَكِيمِ :٢\n \n" +
                    "إِنَّكَ لَمِنَ الْمُرْسَلِينَ :٣\n \n" +
                    "عَلَىٰ صِرٰطٍ مُّسْتَقِيمٍ :٤\n \n" +
                    "تَنزِيلَ الْعَزِيزِ الرَّحِيمِ :٥\n \n" +
                    "لِتُنذِرَ قَوْمًا مَّآ أُنذِرَ ءَابَآؤُهُمْ فَهُمْ غٰفِلُونَ :٦\n \n" +
                    "لَقَدْ حَقَّ الْقَوْلُ عَلَىٰٓ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ :٧\n \n" +
                    "إِنَّا جَعَلْنَا فِىٓ أَعْنٰقِهِمْ أَغْلٰلًا فَهِىَ إِلَى الْأَذْقَانِ فَهُم مُّقْمَحُونَ :٨\n \n" +
                    "وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنٰهُمْ فَهُمْ لَا يُبْصِرُونَ :٩\n \n" +
                    "وَسَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ :١۰\n \n" +
                    "إِنَّمَا تُنذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِىَ الرَّحْمٰنَ بِالْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ :١١\n \n" +
                    "إِنَّا نَحْنُ نُحْىِ الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا۟ وَءَاثٰرَهُمْ ۚ وَكُلَّ شَىْءٍ أَحْصَيْنٰهُ فِىٓ إِمَامٍ مُّبِينٍ :١٢\n \n" +
                    "وَاضْرِبْ لَهُم مَّثَلًا أَصْحٰبَ الْقَرْيَةِ إِذْ جَآءَهَا الْمُرْسَلُونَ :١٣\n \n" +
                    "إِذْ أَرْسَلْنَآ إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوٓا۟ إِنَّآ إِلَيْكُم مُّرْسَلُونَ :١٤\n \n" +
                    "قَالُوا۟ مَآ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَآ أَنزَلَ الرَّحْمٰنُ مِن شَىْءٍ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ :١٥\n \n" +
                    "قَالُوا۟ رَبُّنَا يَعْلَمُ إِنَّآ إِلَيْكُمْ لَمُرْسَلُونَ :١٦\n \n" +
                    "وَمَا عَلَيْنَآ إِلَّا الْبَلٰغُ الْمُبِينُ :١٧\n \n" +
                    "قَالُوٓا۟ إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِن لَّمْ تَنتَهُوا۟ لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ :١٨\n \n" +
                    "قَالُوا۟ طٰٓئِرُكُم مَّعَكُمْ ۚ أَئِن ذُكِّرْتُم ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ :١٩\n \n" +
                    "وَجَآءَ مِنْ أَقْصَا الْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يٰقَوْمِ اتَّبِعُوا۟ الْمُرْسَلِينَ :٢۰\n \n" +
                    "اتَّبِعُوا۟ مَن لَّا يَسْـَٔلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ :٢١\n \n" +
                    "وَمَا لِىَ لَآ أَعْبُدُ الَّذِى فَطَرَنِى وَإِلَيْهِ تُرْجَعُونَ :٢٢\n \n" +
                    "ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدْنِ الرَّحْمٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّى شَفٰعَتُهُمْ شَيْـًٔا وَلَا يُنقِذُونِ :٢٣\n \n" +
                    "إِنِّىٓ إِذًا لَّفِى ضَلٰلٍ مُّبِينٍ :٢٤\n \n" +
                    "إِنِّىٓ ءَامَنتُ بِرَبِّكُمْ فَاسْمَعُونِ :٢٥\n \n" +
                    "قِيلَ ادْخُلِ الْجَنَّةَ ۖ قَالَ يٰلَيْتَ قَوْمِى يَعْلَمُونَ :٢٦\n \n" +
                    "بِمَا غَفَرَ لِى رَبِّى وَجَعَلَنِى مِنَ الْمُكْرَمِينَ :٢٧\n \n" +
                    "وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِۦ مِنۢ بَعْدِهِۦ مِن جُندٍ مِّنَ السَّمَآءِ وَمَا كُنَّا مُنزِلِينَ :٢٨\n \n" +
                    "إِن كَانَتْ إِلَّا صَيْحَةً وٰحِدَةً فَإِذَا هُمْ خٰمِدُونَ :٢٩\n \n" +
                    "يٰحَسْرَةً عَلَى الْعِبَادِ ۚ مَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ :٣۰\n \n" +
                    "أَلَمْ يَرَوْا۟ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ :٣١\n \n" +
                    "وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ :٣٢\n \n" +
                    "وَءَايَةٌ لَّهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنٰهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ :٣٣\n \n" +
                    "وَجَعَلْنَا فِيهَا جَنّٰتٍ مِّن نَّخِيلٍ وَأَعْنٰبٍ وَفَجَّرْنَا فِيهَا مِنَ الْعُيُونِ :٣٤\n \n" +
                    "لِيَأْكُلُوا۟ مِن ثَمَرِهِۦ وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ أَفَلَا يَشْكُرُونَ :٣٥\n \n" +
                    "سُبْحٰنَ الَّذِى خَلَقَ الْأَزْوٰجَ كُلَّهَا مِمَّا تُنۢبِتُ الْأَرْضُ وَمِنْ أَنفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ :٣٦\n \n" +
                    "وَءَايَةٌ لَّهُمُ الَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُم مُّظْلِمُونَ :٣٧\n \n" +
                    "وَالشَّمْسُ تَجْرِى لِمُسْتَقَرٍّ لَّهَا ۚ ذٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ :٣٨\n \n" +
                    "وَالْقَمَرَ قَدَّرْنٰهُ مَنَازِلَ حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ :٣٩\n \n" +
                    "لَا الشَّمْسُ يَنۢبَغِى لَهَآ أَن تُدْرِكَ الْقَمَرَ وَلَا الَّيْلُ سَابِقُ النَّهَارِ ۚ وَكُلٌّ فِى فَلَكٍ يَسْبَحُونَ :٤۰\n \n" +
                    "وَءَايَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِى الْفُلْكِ الْمَشْحُونِ :٤١\n \n" +
                    "وَخَلَقْنَا لَهُم مِّن مِّثْلِهِۦ مَا يَرْكَبُونَ :٤٢\n \n" +
                    "وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنقَذُونَ :٤٣\n \n" +
                    "إِلَّا رَحْمَةً مِّنَّا وَمَتٰعًا إِلَىٰ حِينٍ :٤٤\n \n" +
                    "وَإِذَا قِيلَ لَهُمُ اتَّقُوا۟ مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ :٤٥\n \n" +
                    "وَمَا تَأْتِيهِم مِّنْ ءَايَةٍ مِّنْ ءَايٰتِ رَبِّهِمْ إِلَّا كَانُوا۟ عَنْهَا مُعْرِضِينَ :٤٦\n \n" +
                    "وَإِذَا قِيلَ لَهُمْ أَنفِقُوا۟ مِمَّا رَزَقَكُمُ اللهُ قَالَ الَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوٓا۟ أَنُطْعِمُ مَن لَّوْ يَشَآءُ اللهُ أَطْعَمَهُۥٓ إِنْ أَنتُمْ إِلَّا فِى ضَلٰلٍ مُّبِينٍ :٤٧\n \n" +
                    "وَيَقُولُونَ مَتَىٰ هٰذَا الْوَعْدُ إِن كُنتُمْ صٰدِقِينَ :٤٨\n \n" +
                    "مَا يَنظُرُونَ إِلَّا صَيْحَةً وٰحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ :٤٩\n \n" +
                    "فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَآ إِلَىٰٓ أَهْلِهِمْ يَرْجِعُونَ :٥۰\n \n" +
                    "وَنُفِخَ فِى الصُّورِ فَإِذَا هُم مِّنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ :٥١\n \n" +
                    "قَالُوا۟ يٰوَيْلَنَا مَنۢ بَعَثَنَا مِن مَّرْقَدِنَا ۜ ۗ هٰذَا مَا وَعَدَ الرَّحْمٰنُ وَصَدَقَ الْمُرْسَلُونَ :٥٢\n \n" +
                    "إِن كَانَتْ إِلَّا صَيْحَةً وٰحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ :٥٣\n \n" +
                    "فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْـًٔا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ :٥٤\n \n" +
                    "إِنَّ أَصْحٰبَ الْجَنَّةِ الْيَوْمَ فِى شُغُلٍ فٰكِهُونَ :٥٥\n \n" +
                    "هُمْ وَأَزْوٰجُهُمْ فِى ظِلٰلٍ عَلَى الْأَرَآئِكِ مُتَّكِـُٔونَ :٥٦\n \n" +
                    "لَهُمْ فِيهَا فٰكِهَةٌ وَلَهُم مَّا يَدَّعُونَ :٥٧\n \n" +
                    "سَلٰمٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ :٥٨\n \n" +
                    "وَامْتٰزُوا۟ الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ :٥٩\n \n" +
                    "أَلَمْ أَعْهَدْ إِلَيْكُمْ يٰبَنِىٓ ءَادَمَ أَن لَّا تَعْبُدُوا۟ الشَّيْطٰنَ ۖ إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ :٦۰\n \n" +
                    "وَأَنِ اعْبُدُونِى ۚ هٰذَا صِرٰطٌ مُّسْتَقِيمٌ :٦١\n \n" +
                    "وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا۟ تَعْقِلُونَ :٦٢\n \n" +
                    "هٰذِهِۦ جَهَنَّمُ الَّتِى كُنتُمْ تُوعَدُونَ :٦٣\n \n" +
                    "اصْلَوْهَا الْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ :٦٤\n \n" +
                    "الْيَوْمَ نَخْتِمُ عَلَىٰٓ أَفْوٰهِهِمْ وَتُكَلِّمُنَآ أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا۟ يَكْسِبُونَ :٦٥\n \n" +
                    "وَلَوْ نَشَآءُ لَطَمَسْنَا عَلَىٰٓ أَعْيُنِهِمْ فَاسْتَبَقُوا۟ الصِّرٰطَ فَأَنَّىٰ يُبْصِرُونَ :٦٦\n \n" +
                    "وَلَوْ نَشَآءُ لَمَسَخْنٰهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا اسْتَطٰعُوا۟ مُضِيًّا وَلَا يَرْجِعُونَ :٦٧\n \n" +
                    "وَمَن نُّعَمِّرْهُ نُنَكِّسْهُ فِى الْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ :٦٨\n \n" +
                    "وَمَا عَلَّمْنٰهُ الشِّعْرَ وَمَا يَنۢبَغِى لَهُۥٓ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْءَانٌ مُّبِينٌ :٦٩\n \n" +
                    "لِّيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكٰفِرِينَ :٧۰\n \n" +
                    "أَوَلَمْ يَرَوْا۟ أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَآ أَنْعٰمًا فَهُمْ لَهَا مٰلِكُونَ :٧١\n \n" +
                    "وَذَلَّلْنٰهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ :٧٢\n \n" +
                    "وَلَهُمْ فِيهَا مَنٰفِعُ وَمَشَارِبُ ۖ أَفَلَا يَشْكُرُونَ :٧٣\n \n" +
                    "وَاتَّخَذُوا۟ مِن دُونِ اللهِ ءَالِهَةً لَّعَلَّهُمْ يُنصَرُونَ :٧٤\n \n" +
                    "لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ :٧٥\n \n" +
                    "فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ :٧٦\n \n" +
                    "أَوَلَمْ يَرَ الْإِنسٰنُ أَنَّا خَلَقْنٰهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ :٧٧\n \n" +
                    "وَضَرَبَ لَنَا مَثَلًا وَنَسِىَ خَلْقَهُۥ ۖ قَالَ مَن يُحْىِ الْعِظٰمَ وَهِىَ رَمِيمٌ :٧٨\n \n" +
                    "قُلْ يُحْيِيهَا الَّذِىٓ أَنشَأَهَآ أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ :٧٩\n \n" +
                    "الَّذِى جَعَلَ لَكُم مِّنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَآ أَنتُم مِّنْهُ تُوقِدُونَ :٨۰\n \n" +
                    "أَوَلَيْسَ الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِقٰدِرٍ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُم ۚ بَلَىٰ وَهُوَ الْخَلّٰقُ الْعَلِيمُ :٨١\n \n" +
                    "إِنَّمَآ أَمْرُهُۥٓ إِذَآ أَرَادَ شَيْـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ :٨٢\n \n" +
                    "فَسُبْحٰنَ الَّذِى بِيَدِهِۦ مَلَكُوتُ كُلِّ شَىْءٍ وَإِلَيْهِ تُرْجَعُونَ :٨٣\n \n","-","-","-",
                "referensi https://ayatalquran.net/2014/11/surah-yaa-siin-%d9%8a%d8%b3-tulisan-arab/")) */

            return listDua
        }


    }

}